СкладГП/src/Catalogs/БазыПУ/БазыПУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БазыПУ</name>
  <predefined>
    <items>
      <name>ЛДК</name>
      <description>ЛДК</description>
    </items>
    <items>
      <name>Свирь</name>
      <description>Свирь</description>
    </items>
    <items>
      <name>ХЛП</name>
      <description>ХЛП</description>
    </items>
  </predefined>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>350</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛогинСлужебный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольСлужебный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>https</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДляPing</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УзелПланаОбмена</name>
    <type>
      <types>ExchangePlanRef.МобильноеПриложениеСкладПУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоERP</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКопия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

СкладГП/src/Catalogs/Склады/Склады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Склады</name>
  <owners>Catalog.БазыПУ</owners>
  <attributes>
    <name>ИмяПредопределенногоПУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВспомогательныйСклад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьПриАвторизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

СкладГП/src/Catalogs/БазыПУ/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура СоздатьНовую(Команда)
	ТекДанные = Элементы.Список.ТекущиеДанные;
	НачатьСоздатьНовую(ТекДанные)
КонецПроцедуры

&НаСервере
Функция СоздатьКопиюБазы(Оригинал)
	Копия = Справочники.БазыПУ.СоздатьЭлемент(); 
	Копия.ОбменДанными.Загрузка = ИСТИНА;
	Копия.Наименование = Оригинал.Наименование+"_Копия";
	Копия.УстановитьНовыйКод("я");
	Копия.ЭтоКопия = Истина;
	ЗаполнитьЗначенияСвойств(Копия, Оригинал, "Адрес,ЛогинСлужебный,ПарольСлужебный,https,АдресДляPing,ЭтоERP");
	Копия.Записать(); 
	КопияСсылка = Копия.Ссылка;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Склады.Ссылка КАК Ссылка,
	|	Склады.Наименование КАК Наименование,
	|	Склады.ИмяПредопределенногоПУ КАК ИмяПредопределенногоПУ,
	|	Склады.ОтображатьПриАвторизации КАК ОтображатьПриАвторизации,
	|	Склады.ВспомогательныйСклад.Наименование КАК ВспомогательныйСкладНаименование,
	|	Склады.ВспомогательныйСклад.ИмяПредопределенногоПУ КАК ВспомогательныйСкладИмяПредопределенногоПУ,
	|	Склады.ВспомогательныйСклад.ОтображатьПриАвторизации КАК ВспомогательныйСкладОтображатьПриАвторизации
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.Владелец = &Владелец
	|	И Склады.ОтображатьПриАвторизации";
	Запрос.УстановитьПараметр("Владелец", Оригинал);
	Выборка  =Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
		
	Вспом = Справочники.Склады.СоздатьЭлемент();
	Вспом.Владелец = КопияСсылка;
	Вспом.Наименование = Выборка.ВспомогательныйСкладНаименование;
	Вспом.ИмяПредопределенногоПУ = Выборка.ВспомогательныйСкладИмяПредопределенногоПУ;
	Вспом.ОтображатьПриАвторизации = Выборка.ВспомогательныйСкладОтображатьПриАвторизации;
	Вспом.Записать();
	
	ГП = Справочники.Склады.СоздатьЭлемент();
	ГП.Владелец = КопияСсылка;
	ГП.Наименование = Выборка.Наименование;
	ГП.ИмяПредопределенногоПУ = Выборка.ИмяПредопределенногоПУ;
	ГП.ОтображатьПриАвторизации = Выборка.ОтображатьПриАвторизации; 
	ГП.ВспомогательныйСклад = Вспом.Ссылка;
	ГП.Записать();

	Копия.УзелПланаОбмена = МобильноеПриложениеСкладПУ.ПолучитьСоздатьУзелПланаОбменаПУ(Копия);
	
	Копия.Записать();
	
КонецФункции

&НаКлиенте
Асинх Процедура НачатьСоздатьНовую(ТекДанные)
	Если Ждать ПроверитьПароль() Тогда
		СоздатьКопиюБазы(ТекДанные.Ссылка);	
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Асинх Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	Если Ждать ПроверитьПароль() Тогда
		ОткрытьФорму("Справочник.БазыПУ.Форма.ФормаЭлемента", Новый Структура("Ключ,ДоступЕсть", Элементы.Список.ТекущаяСтрока, ИСТИНА));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Асинх Функция ПроверитьПароль()
	Пароль = "";
	Пароль = Ждать ВвестиСтрокуАсинх(Пароль,"Введите пароль доступа", 20, ЛОЖЬ);
	Возврат Пароль = "475000"
КонецФункции
